import random

# 1. Вывести шапку
print("Результаты десяти выстрелов по мишени:")
print("+----------+----------+-----------+")
print("|    X     |    Y     | Попадание |")
print("+----------+----------+-----------+")

r = float(input("Введите R: "))

# 2. В цикле от 1 до 10
for i in range(0, 10):
    # 3. Сформировать координаты точки X, Y
    x = random.uniform(-r, 2 * r)
    y = random.uniform(-r, r)

    # 4. Определить попадание точки в заданную область
    in_circle = (x + r) ** 2 + (y - r) ** 2 <= r ** 2
    in_rectangle = (0 <= x <= 2 * r) and (-r <= y <= 0)

    if in_circle or in_rectangle:
        flag = 1
    else:
        flag = 0

    # 5. Вывести координаты точки
    print("| {0:8.2f} | {1:8.2f} |".format(x, y), end=" ")

    # 6. Вывести результат Yes или No в соответствии с флагом
    if flag == 1:
        print("   Yes     |")
    else:
        print("   No      |")

# Завершение таблицы
print("+----------+----------+-----------+")